# CCNA2 - Chapter 10 - DHCP (Dynamic Host Configuration Protocol)
## Caracteristics
- UDP port : 68 for sender and 67 for receiver, reverse for server

## DHCPv4
Methods :
- Manual Attribution : manually bind IPv4 with mac
- Automatic Attribution : buy IPv4 for unlimited time
- Dynammic Attribution : rent IPv4 for limited time

Message format of DHCPv4
- OP : Message type
- Device type
- physical address size  
- hope counter
- Transaction ID
- Seconds
- Client IP address
- new IP address
- Server IP
- Gateway IP
- Physical client address
- Server Name
- Bootstrap name file
- DHCP option

Message types :
- DHCPDISCOVER (IP source : `0.0.0.0` )
- DHCPOFFER
- DHCPREQUEST (renew rent)
- DHCPACK

Steps :
- DHCPDISCOVER
- DHCPOFFER
- DHCPREQUEST
- DHCPACK

- Show :
  - From server :
    - `show ip dhcp binding` : MAC@ <-> IP@
    - `show ip dhcp server statistics` :
    - `show ip dhcp conflict`
  - From Client :
    - `show running-config | section dhcp` :

- `[no] ip dhcp excluded-address <low-address> [<high-address>]` : exclude range of address

-  Relay :`ip helper-address <next-hop-dns-ip-address>` : foward some UDP services -> heure,TACAS, DNS, client BOOTTP/DHCP,  server BOOTTP/DHCP, TFTP, names service NetBios, datagram service NetBios

-`[no] ip address dhcp` : set ip address from dhcp servers

- `[no] ip dhcp pool <pool-name>` : enter dhcp config mode

 Configure DHCP server:
- `network <ip-address> <ip-mask>` : Set pool of address
- `default-router <gateway-address> [gateway-address2] [...]` : Set default gateway address
- `dns-server <dns-address>` : set dns server address
- `domain-name <domain-name>`
- `lease <time>` : define leasing time

- `debug ip packet`
- `debug ip dhcp server events`

## DHCPv6
DHCPv6 with ICMPv6, messages :
- RA : Router announcement (Multicast IPv6 from router)
- RS : Router solicitation (Multicast IPv6 to router)

Client check if IPv6 not already used on network with NS (Neighborhood Sollicitation -ARP like)
RFC 4861 -> ask IPv6 device to DAD (Double Address Detection)

Methods :
- SLAAC (State Less Automatic Address Configuration) -> No need DHCP server (default mode)
- DHCPv6 stateless (SLACC + DHCPv6)
- DHCPv6 stateful (DHCPv6)


>  M=1 -> Stateful
>  M=0,O=1 -> Stateless
>  M=0, O=0 -> SLAAC

- Show ipv6 dhcp pool : `show ipv6 dhcp pool`

- Relay
```
R1(config)#interface <int>
R1(config-if)#ipv6 dhcp relay destination <ipv6-address>
```
- `debug ipv6 dhcp detail`
### SLACC

SLACC Flag :
- O Other conf (0 default)
- M Managed config (0 default)
- change SLACC FLAG with :
  - `[no] ipv6 nd other-config-flag `
  - `[no] ipv6 nd managed-flag `

```
R1(config)#interface <int>
R1(config-if)#no ipv6 nd managed-config-flag // M=0
R1(config-if)#no ipv6 nd other-config-flag // O=0
```

### DHCPv6 stateless
```
R1(config)#ipv6 unicast-routing
# Setup DHCP pool
R1(config)#ipv6 dhcp pool <pool-name>
R1(config-dhcpv6)#dns-server <dns-server-address>
R1(config-dhcpv6)#domain-name <domain-name>
# Setup interface
R1(config)#interface <int>
R1(config-if)#ipv6 dhcp server <pool-name>
R1(config-if)#ipv6 nd other-config-flag // O=1
```

Client :
```
R1(config)#interface <int>
R1(config-if)#ipv6 enable // Generate link-local
R1(config-if)#ipv6 autoconfig // use SLAAC + DHCPv6 server
```
### DHCPv6 statefull

```
R1(config)#ipv6 unicast-routing
# Setup DHCP pool
R1(config)#ipv6 dhcp pool <pool-name>
R1(config-dhcpv6)#address <prefix>/<prefix_length> [lifetime {<valide-lifetime> <preferred-lifetime> | infinite}]
R1(config-dhcpv6)#dns-server <dns-server-address>
R1(config-dhcpv6)#domain-name <domain-name>
# Setup interface
R1(config)#interface <int>
R1(config-if)#ipv6 dhcp server <pool-name>
R1(config-if)#ipv6 nd managed-config-flag // M=1
```

Client :
```
R1(config)#interface <int>
R1(config-if)#ipv6 enable // Generate link-local
R1(config-if)#ipv6 address dhcp // Use full DHCPv6 server
```

### Misc
MSDOS :
- `ipconfig /release`
- `ipconfig /renew`

## Debrief
- DHCPv4 :
  - Manually allocation
  - Automatique allocation
  - Dynamic allocation
